app/controllers/checklists_controller.rb

  def index
    @checklists = Checklist.all
---
SELECT * FROM "checklists"

  def show
    @checklist = Checklist.find(params[:id])
---
SELECT * FROM "checklists" WHERE ("checklists"."id" = 1)

  def edit
    @checklist = Checklist.find(params[:id])
---
SELECT * FROM "checklists" WHERE ("checklists"."id" = 1)

  def create
    @checklist = Checklist.new(params[:checklist])

    respond_to do |format|
      if @checklist.save
---
INSERT INTO "checklists" ("updated_at", "orientation", "badge", "tool_bottom", "order_number", "tool_down", "part_number", "layer", "created_at") VALUES('2010-02-13 15:29:16', 'Gimbals Up', '54276', '0944448', 'C200034', '0944449', 1, 'NiAu', '2010-02-13 15:29:16')

  def update
    @checklist = Checklist.find(params[:id])

    respond_to do |format|
      if @checklist.update_attributes(params[:checklist])
---
SELECT * FROM "checklists" WHERE ("checklists"."id" = 1)
UPDATE "checklists" SET "order_number" = 'hghgh', "updated_at" = '2010-02-13 15:54:52' WHERE "id" = 3