app/controllers/verification_controller.rb

  def submit_setup
    checklist = Checklist.new(params[:checklist])
    verification = session[:verification]
    verification.checklists << checklist
---
INSERT INTO "checklists" ("updated_at", "verification_id", "orientation", "badge", "tool_bottom", "order_number", "tool_down", "part_number", "layer", "created_at") VALUES('2010-02-13 19:46:21', NULL, 'kkkk', 'jfklsdj', 'kk', 'kdkddka', 'kjkj', 99, 'dfkdja', '2010-02-13 19:46:21')
INSERT INTO "verifications" ("updated_at", "created_at") VALUES('2010-02-13 20:04:08', '2010-02-13 20:04:08')

  def submit_audit
    checklist = Checklist.new(params[:checklist])
    verification = session[:verification]
    verification.checklists << checklist
---
INSERT INTO "checklists" ("updated_at", "verification_id", "orientation", "badge", "tool_bottom", "order_number", "tool_down", "part_number", "layer", "created_at") VALUES('2010-02-13 19:49:26', NULL, 'cool', 'test of audit', 'is ', 'check', 'tony', 888, 'check', '2010-02-13 19:49:26')
INSERT INTO "verifications" ("updated_at", "created_at") VALUES('2010-02-13 20:13:30', '2010-02-13 20:13:30')